{
  "backend/main.mo": "Motoko backend defining types and storage maps for transactions, categories, rules, budgets, alerts, and goals, with implemented add methods for transactions, categories, and rules (partially shown).",
  "feature_evidence.json": "Feature evidence report listing implemented features, linked files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication gate via Internet Identity, and app layout using TanStack Router and ThemeProvider.",
  "frontend/src/components/categories/CategoryFormDialog.tsx": "Dialog form allowing users to create a new category and submit it to the backend.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing navigation, footer, and content container for authenticated pages.",
  "frontend/src/components/layout/AppNav.tsx": "Responsive navigation bar with links to all app sections and mobile sheet menu.",
  "frontend/src/components/rules/RuleFormDialog.tsx": "Dialog for adding auto-categorization rules, currently disabled due to missing backend category-fetch support.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "React dialog form for adding a transaction, handling validation, timestamp conversion, and submitting via useAddTransaction.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and exposing identity state and helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for adding transactions, categories, and rules using the backend actor and invalidating related queries.",
  "frontend/src/index.css": "Tailwind setup with CSS variables for light/dark themes and base styling overrides.",
  "frontend/src/main.tsx": "Entry point that mounts the app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BudgetsAlerts.tsx": "UI page showing budgets and alerts tabs with placeholder notices indicating missing backend functionality.",
  "frontend/src/pages/CategoriesRules.tsx": "Page for managing categories and auto-categorization rules with dialogs and notices about incomplete backend fetch methods.",
  "frontend/src/pages/Dashboard.tsx": "UI for the dashboard showing summary cards and placeholder charts, with notices that backend data-fetching methods are not yet implemented.",
  "frontend/src/pages/Goals.tsx": "Savings goals page displaying a disabled add-goal button and placeholder content, noting missing backend support.",
  "frontend/src/pages/Settings.tsx": "Settings page showing Internet Identity principal info, security notice, and a sign‑out button.",
  "frontend/src/pages/SignIn.tsx": "Sign‑in screen using Internet Identity with a styled marketing header and feature previews.",
  "frontend/src/pages/Transactions.tsx": "Transactions page allowing adding new transactions but showing placeholders for listing due to incomplete backend fetch methods.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing architecture, requirements, existing features, and planned FinTrack functionality."
}